part-3.org
#+Title: Clojure School
#+Author: Likely
#+Email: 

#+REVEAL_EXTRA_CSS: css/zenburn.css
#+REVEAL_THEME: solarized
#+OPTIONS: num:nil toc:nil reveal_mathjax:t history:t
#+REVEAL_TRANS: fade

* Today's lesson

  - macros
  - core.async
  - clojurescript

* These are big topics!

We could easily spend a day on each one.

We'll give you an understanding of the basics, and hopefully the hunger to find out more.


* What are Macros?

A macro is just a function that receives its arguments *unevaluated* at compile time.

Because the unevaluated arguments are *code*, macros can operate on the code as if it was data*.

(* code is data)

* Why are Macros? 

If *functions* receive data and return new data,

Macros receive *code* and return *new code*.

Because the macro receives its code unevaluated, the code doesn't have to be valid Clojure. This is how macros can extend the language in new ways.


* Examples
  
#+BEGIN_SRC clojure
  (ns clojureschool.handler
    (:require [clojure.walk :refer [macroexpand-all]]))
  
  (macroexpand-all '(defroutes app-routes
    (GET "/" [] (counter-view (swap! counter inc)))
    (route/resources "/")
    (route/not-found "Not Found")))
  
#+END_SRC

#+BEGIN_SRC clojure
  (def app-routes
      (compojure.core/routes
       (compojure.core/make-route
        :get
        (clout.core/route-compile "/")
        (fn* ([request__1478__auto__]
                (let* []
                      (counter-view (swap! counter inc))))))
       (route/resources "/")
       (route/not-found "Not Found")))
#+END_SRC

* Left-handed Clojure

What if Clojure wanted functions to come *after* their arguments? No problem!

#+begin_src clojure
  (ns clojureschool.handler
    (:require [clojure.walk :refer [macroexpand-all prewalk]]))
  
  (defn reverse-if-list [expr]
    (if (list? expr)
      (reverse expr)
      expr))
  
  (defmacro left-handed [expr]
    (prewalk reverse-if-list expr))
#+end_src

Does it work?

#+begin_src clojure
(macroexpand-all
 '(left-handed
   ("Hello Mirror World" println)))
#+end_src

We can even nest expressions!

#+begin_src clojure
(left-handed ((1 1 +) "One plus one is " str))
#+end_src

* Why are macros useful?

Many core library functions are expressed using macros:

e.g. and, or, when, while, for, cond

#+begin_src clojure
(macroexpand '(when true (println "It's true!")))
#+end_src

* Why are macros useful?

Also useful for replacing template code:

with-open

#+begin_src clojure
(use 'clojure.java.io)
(with-open [rdr (reader "/tmp/test.txt")]
  ;; Do something to file.
  ;; File will be closed automatically
  ;; at the end of the expression
)
#+end_src


* Exercise

#+begin_src clojure

;; Re-write the below using -> threading macro
(/ (* (+ 10 2) 5) (* 2 5))

  
;; Re-write the below using ->> threading macro
(* 10 (apply + (map inc (range 10))))
#+end_src

* This week's project

Last week we made a visitor counter, this week we'll make a chat application

* The chat application

#+begin_src bash
lein new compojure chitter
#+end_src


Add a vew with a simple form to add chat messages.

Messages are stored in an atom

* The application so far...

#+begin_src clojure
(def messages (atom []))

(defn index-view [messages]
  (html5
   [:body
    [:h1 "Chitter Chat"]
    [:form {:method "post"}
     [:div [:textarea {:name "message"}]]
     [:input {:type "submit" :value "Post Message"}]]
    [:ul (for [message messages]
           [:li message])]]))

(GET "/" [] (index-view @messages))
#+end_src


* This should be familiar from last week

* User data

Add a POST route for dealing with user data

#+begin_src clojure
(POST "/" [message]
        (-> messages (swap! conj message) index-view))
#+end_src

* This is synchronous

If we're going to make a game, how can we do this without reloading the page?

* We need to use a websocket-capable server

Add these to dependencies..

#+begin_src clojure
[http-kit "2.0.0-SNAPSHOT"]
[ring/ring-devel "1.1.8"]
#+end_src

... and a 'main' handler

#+begin_src clojure
  :main chitter.handler
#+end_src

... include the new server

#+begin_src clojure
[org.httpkit.server :refer [run-server]]
#+end_src

... and a main function to be called

#+begin_src clojure
(defn -main [& args]
  (run-server app {:port 3000}))
#+end_src


* What have we done?

We've completely replaced the server that our application runs within.

Because our new server works with ring request/response maps, we don't have to do anything more.

* Start up again

This time execute `lein run`:

lein run

This will always execute the -main function in your handler. We have made this start the server.

