part-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Clojure School)</title>
<meta name="author" content="(Likely)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/solarized.css" id="theme"/>
<link rel="stylesheet" href="css/zenburn.css"/>
<link rel="stylesheet" href="./reveal.js/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Clojure School</h1>
<h2>Likely</h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>

<section>
<section id="sec-1" >

<h2>Today's lesson</h2>
<ul class="org-ul">
<li>macros
</li>
<li>core.async
</li>
<li>clojurescript
</li>
</ul>
</section>
</section>
<section>
<section id="sec-2" >

<h2>These are big topics!</h2>
<p>
We could easily spend a day on each one.
</p>

<p>
We'll give you an understanding of the basics, and hopefully the hunger to find out more.
</p>
</section>

</section>
<section>
<section id="sec-3" >

<h2>What are Macros?</h2>
<p>
A macro is just a function that receives its arguments <b>unevaluated</b> at compile time.
</p>

<p>
Because the unevaluated arguments are <b>code</b>, macros can operate on the code as if it was data*.
</p>

<p>
(* code is data)
</p>
</section>
</section>
<section>
<section id="sec-4" >

<h2>Why are Macros?</h2>
<p>
If <b>functions</b> receive data and return new data,
</p>

<p>
Macros receive <b>code</b> and return <b>new code</b>.
</p>

<p>
Because the macro receives its code unevaluated, the code doesn't have to be valid Clojure. This is how macros can extend the language in new ways.
</p>
</section>

</section>
<section>
<section id="sec-5" >

<h2>Examples</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">ns</span> clojureschool.handler
  (<span style="color: #00ffff;">:require</span> [clojure.walk <span style="color: #00ffff;">:refer</span> [macroexpand-all]]))

(<span style="color: #ffff00;">macroexpand-all</span> '(<span style="color: #00ff00;">defroutes</span> <span style="color: #0000ff;">app-routes</span>
  (<span style="color: #ff0000;">GET</span> <span style="color: #00ffff;">"/"</span> [] (counter-view (<span style="color: #00ff00;">swap!</span> counter inc)))
  (route/resources <span style="color: #00ffff;">"/"</span>)
  (route/not-found <span style="color: #00ffff;">"Not Found"</span>)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app-routes</span>
    (compojure.core/routes
     (compojure.core/make-route
      <span style="color: #00ffff;">:get</span>
      (clout.core/route-compile <span style="color: #00ffff;">"/"</span>)
      (fn* ([request__1478__auto__]
              (let* []
                    (counter-view (<span style="color: #00ff00;">swap!</span> counter inc))))))
     (route/resources <span style="color: #00ffff;">"/"</span>)
     (route/not-found <span style="color: #00ffff;">"Not Found"</span>)))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-6" >

<h2>Left-handed Clojure</h2>
<p>
What if Clojure wanted functions to come <b>after</b> their arguments? No problem!
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">ns</span> clojureschool.handler
  (<span style="color: #00ffff;">:require</span> [clojure.walk <span style="color: #00ffff;">:refer</span> [macroexpand-all prewalk]]))

(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">reverse-if-list</span> [expr]
  (<span style="color: #00ff00;">if</span> (<span style="color: #00ff00;">list?</span> expr)
    (<span style="color: #00ff00;">reverse</span> expr)
    expr))

(<span style="color: #00ff00;">defmacro</span> <span style="color: #0000ff;">left-handed</span> [expr]
  (<span style="color: #ffff00;">prewalk</span> reverse-if-list expr))
</pre>
</div>

<p>
Does it work?
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #ffff00;">macroexpand-all</span>
 '(left-handed
   (<span style="color: #00ffff;">"Hello Mirror World"</span> println)))
</pre>
</div>

<p>
We can even nest expressions!
</p>

<div class="org-src-container">

<pre class="src src-clojure">(left-handed ((1 1 +) <span style="color: #00ffff;">"One plus one is "</span> str))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-7" >

<h2>Why are macros useful?</h2>
<p>
Many core library functions are expressed using macros:
</p>

<p>
e.g. and, or, when, while, for, cond
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">macroexpand</span> '(<span style="color: #00ff00;">when</span> true (<span style="color: #00ff00;">println</span> <span style="color: #00ffff;">"It's true!"</span>)))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-8" >

<h2>Why are macros useful?</h2>
<p>
Also useful for replacing template code:
</p>

<p>
with-open
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">use</span> 'clojure.java.io)
(<span style="color: #00ff00;">with-open</span> [rdr (reader <span style="color: #00ffff;">"/tmp/test.txt"</span>)]
  <span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">Do something to file.</span>
  <span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">File will be closed automatically</span>
  <span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">at the end of the expression</span>
)
</pre>
</div>
</section>

</section>
<section>
<section id="sec-9" >

<h2>Exercise</h2>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">Re-write the below using -&gt; threading macro</span>
(<span style="color: #00ff00;">/</span> (<span style="color: #00ff00;">*</span> (<span style="color: #00ff00;">+</span> 10 2) 5) (<span style="color: #00ff00;">*</span> 2 5))


<span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">Re-write the below using -&gt;&gt; threading macro</span>
(<span style="color: #00ff00;">*</span> 10 (<span style="color: #00ff00;">apply</span> + (<span style="color: #00ff00;">map</span> inc (<span style="color: #00ff00;">range</span> 10))))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-10" >

<h2>This week's project</h2>
<p>
Last week we made a visitor counter, this week we'll make a chat application
</p>
</section>
</section>
<section>
<section id="sec-11" >

<h2>The chat application</h2>
<div class="org-src-container">

<pre class="src src-bash">lein new compojure chitter
</pre>
</div>


<p>
Add a vew with a simple form to add chat messages.
</p>

<p>
Messages are stored in an atom
</p>
</section>
</section>
<section>
<section id="sec-12" >

<h2>The application so far&#x2026;</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">messages</span> (<span style="color: #00ff00;">atom</span> []))

(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">index-view</span> [messages]
  (html5
   [<span style="color: #00ffff;">:body</span>
    [<span style="color: #00ffff;">:h1</span> <span style="color: #00ffff;">"Chitter Chat"</span>]
    [<span style="color: #00ffff;">:form</span> {<span style="color: #00ffff;">:method</span> <span style="color: #00ffff;">"post"</span>}
     [<span style="color: #00ffff;">:div</span> [<span style="color: #00ffff;">:textarea</span> {<span style="color: #00ffff;">:name</span> <span style="color: #00ffff;">"message"</span>}]]
     [<span style="color: #00ffff;">:input</span> {<span style="color: #00ffff;">:type</span> <span style="color: #00ffff;">"submit"</span> <span style="color: #00ffff;">:value</span> <span style="color: #00ffff;">"Post Message"</span>}]]
    [<span style="color: #00ffff;">:ul</span> (<span style="color: #00ff00;">for</span> [message messages]
           [<span style="color: #00ffff;">:li</span> message])]]))

(<span style="color: #ff0000;">GET</span> <span style="color: #00ffff;">"/"</span> [] (index-view @messages))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-13" >

<h2>This should be familiar from last week</h2>
</section>

</section>
<section>
<section id="sec-14" >

<h2>User data</h2>
<p>
Add a POST route for dealing with user data
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #ff0000;">POST</span> <span style="color: #00ffff;">"/"</span> [message]
        (<span style="color: #00ff00;">-&gt;</span> messages (<span style="color: #00ff00;">swap!</span> conj message) index-view))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-15" >

<h2>This is synchronous</h2>
<p>
If we're going to make a game, how can we do this without reloading the page?
</p>
</section>
</section>
<section>
<section id="sec-16" >

<h2>We need to use a websocket-capable server</h2>
<p>
Add these to dependencies..
</p>

<div class="org-src-container">

<pre class="src src-clojure">[http-kit <span style="color: #00ffff;">"2.0.0-SNAPSHOT"</span>]
[ring/ring-devel <span style="color: #00ffff;">"1.1.8"</span>]
</pre>
</div>

<p>
&#x2026; and a 'main' handler
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ffff;">:main</span> chitter.handler
</pre>
</div>

<p>
&#x2026; include the new server
</p>

<div class="org-src-container">

<pre class="src src-clojure">[org.httpkit.server <span style="color: #00ffff;">:refer</span> [run-server]]
</pre>
</div>

<p>
&#x2026; and a main function to be called
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">-main</span> [&amp; args]
  (run-server app {<span style="color: #00ffff;">:port</span> 3000}))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-17" >

<h2>What have we done?</h2>
<p>
We've completely replaced the server that our application runs within.
</p>

<p>
Because our new server works with ring request/response maps, we don't have to do anything more.
</p>
</section>
</section>
<section>
<section id="sec-18" >

<h2>Start up again</h2>
<p>
This time execute `lein run`:
</p>

<p>
lein run
</p>

<p>
This will always execute the -main function in your handler. We have made this start the server.
</p>
</section>
</section>
