part-3.org
* Hot reloading

We included ring-devel earlier, this was so we could enable code reloading.

#+begin_src clojure
[ring.middleware.reload :refer [wrap-reload]]
#+end_src


#+begin_src clojure
(def app
  (-> app-routes wrap-reload handler/site))
#+end_src


* Middleware

Middleware are functions which are chained together and  adapt requests and/or responses


#+begin_src clojure
(defn wrap-log-request [handler]
  (fn [req]
    (println req)
    (handler req)))

(def app
  (handler/site (wrap-log-request app-routes)))
#+end_src


* Middleware can be chained


#+begin_src clojure
(defn wrap-log-request [handler]
  (fn [request]
    (println request)
    (handler request)))

(defn wrap-log-response [handler]
  (fn [request]
    (let [response (handler request)]
      (println response)
      response)))

(def app
  (handler/site (wrap-log-response (wrap-log-request app-routes))))
#+end_src
  
* Threading macros


#+begin_src clojure
(def app
  (-> app-routes
      wrap-request-log
      wrap-response-log
      handler/site))

;; Compared with...

(def app
  (handler/site (wrap-response-log (wrap-request-log app-routes))))
#+end_src


* Useful Middleware
  e.g for JSON response

#+begin_src clojure
;; In project.clj
:dependencies [[ring-middleware-format "0.3.1"] ...]
#+end_src


#+begin_src clojure
(ns clojureschool.handler
  (:require [ring.middleware.format :refer [wrap-restful-format]]))

(def app
  (-> app-routes
      (wrap-restful-format :formats [:json-kw :edn])
      handler/site))
#+end_src

This instructs ring to convert Clojure data structures to their JSON equivalent, or as edn format if the Accept header requests it.

Also middleware for cookies, authentication, rate limiting, compression etc...


* Async code

#+begin_src clojure
(macroexpand-all
 '(with-channel request channel
    (on-receive channel
                (fn [data]
                  (send! channel data)))))
#+end_src

Macro expands to...

#+begin_src clojure
(let* [channel (:async-channel request)]
      (if (:websocket? request)
        (let* [temp__4090__auto__ (clojure.core/get-in request [:headers "sec-websocket-key"])]
              (if temp__4090__auto__
                (let* [key__2755__auto__ temp__4090__auto__]
                      (do (. channel sendHandshake {"Sec-WebSocket-Accept" (org.httpkit.server/accept key__2755__auto__)
                                                    "Upgrade" "websocket"
                                                    "Connection" "Upgrade"})
                          (on-receive channel
                                      (fn* ([data] (send! channel data))))
                          {:body channel})) {:status 400
                                             :body "Bad Sec-WebSocket-Key header"}))
        (do (on-receive channel
                        (fn* ([data] (send! channel data))))
            {:body channel})))
#+end_src


* Websockets

Websockets are long-lived connections between the client and the server through which messages can be sent in both directions.

* In your browser's js console...

#+begin_src js
var socket = new WebSocket("ws://localhost:3000/echo");

socket.onmessage = function(event) { console.log(event.data); }

socket.send("Data to be sent");
#+end_src

You should see the data you sent echoed back.

* Exercise

Make the server multi-client.

Keep a list of connected clients and send each message to all clients.

Test it out with two browser windows.

* One I prepared earlier

#+begin_src clojure
(def clients (atom []))

(defn make-socket! [request]
  (with-channel request client
    (swap! clients conj client)
    (on-receive client
                (fn [data]
                  (doseq [a-client @clients]
                    (send! a-client data))))))
#+end_src

* ClojureScript

You can write client-side javascript in Clojure too!


* Include Clojurescript in your project

In dependencies... 

#+begin_src clojure
:dependencies [[org.clojure/clojurescript "0.0-XXXX"] ...]
#+end_src

Clojurescript is compiled, so add the compiler to your plugins...

#+begin_src clojure
:plugins [[lein-cljsbuild "1.0.1-SNAPSHOT"] ...]
#+end_src

... And tell cljsbuild where to put your compiled javascript:

#+begin_src clojure
:cljsbuild {:builds {:main {:compiler {:output-to "resources/public/js/main.js"}}}}
#+end_src

* Keeping the Clojure(Script) separate

Next to your /src directory, create a /src-cljs/chitter directory

This is where cljsbuild will look for clojurescript files by default

* Writing your first ClojureScript

Create the file

/src-cljs/chitter/client.cljs

#+begin_src clojure
(ns chitter.client)

(defn greet [name]
  (str "Hello " name))
#+end_src

And visit...

http://localhost:3000/js/main.js

* Include this in our page

#+begin_src clojure
[hiccup.page :refer [html5 include-js]]
#+end_src

#+begin_src clojure
(html5
   [:head
    (include-js "js/main.js")]
   [:body ....
   ])
#+end_src

