part-3.html
<section>
<section id="sec-19" >

<h2>Hot reloading</h2>
<p>
We included ring-devel earlier, this was so we could enable code reloading.
</p>

<div class="org-src-container">

<pre class="src src-clojure">[ring.middleware.reload <span style="color: #00ffff;">:refer</span> [wrap-reload]]
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (<span style="color: #00ff00;">-&gt;</span> app-routes wrap-reload handler/site))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-20" >

<h2>Middleware</h2>
<p>
Middleware are functions which are chained together and  adapt requests and/or responses
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">wrap-log-request</span> [handler]
  (<span style="color: #00ff00;">fn</span> [req]
    (<span style="color: #00ff00;">println</span> req)
    (handler req)))

(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (handler/site (wrap-log-request app-routes)))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-21" >

<h2>Middleware can be chained</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">wrap-log-request</span> [handler]
  (<span style="color: #00ff00;">fn</span> [request]
    (<span style="color: #00ff00;">println</span> request)
    (handler request)))

(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">wrap-log-response</span> [handler]
  (<span style="color: #00ff00;">fn</span> [request]
    (<span style="color: #00ff00;">let</span> [response (handler request)]
      (<span style="color: #00ff00;">println</span> response)
      response)))

(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (handler/site (wrap-log-response (wrap-log-request app-routes))))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-22" >

<h2>Threading macros</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (<span style="color: #00ff00;">-&gt;</span> app-routes
      wrap-request-log
      wrap-response-log
      handler/site))

<span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">Compared with...</span>

(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (handler/site (wrap-response-log (wrap-request-log app-routes))))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-23" >

<h2>Useful Middleware</h2>
<p>
e.g for JSON response
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ff00; font-style: italic;">;; </span><span style="color: #00ff00; font-style: italic;">In project.clj</span>
<span style="color: #00ffff;">:dependencies</span> [[ring-middleware-format <span style="color: #00ffff;">"0.3.1"</span>] ...]
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">ns</span> clojureschool.handler
  (<span style="color: #00ffff;">:require</span> [ring.middleware.format <span style="color: #00ffff;">:refer</span> [wrap-restful-format]]))

(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">app</span>
  (<span style="color: #00ff00;">-&gt;</span> app-routes
      (wrap-restful-format <span style="color: #00ffff;">:formats</span> [<span style="color: #00ffff;">:json-kw</span> <span style="color: #00ffff;">:edn</span>])
      handler/site))
</pre>
</div>

<p>
This instructs ring to convert Clojure data structures to their JSON equivalent, or as edn format if the Accept header requests it.
</p>

<p>
Also middleware for cookies, authentication, rate limiting, compression etc&#x2026;
</p>
</section>

</section>
<section>
<section id="sec-24" >

<h2>Async code</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #ffff00;">macroexpand-all</span>
 '(with-channel request channel
    (on-receive channel
                (<span style="color: #00ff00;">fn</span> [data]
                  (send! channel data)))))
</pre>
</div>

<p>
Macro expands to&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-clojure">(let* [channel (<span style="color: #00ffff;">:async-channel</span> request)]
      (<span style="color: #00ff00;">if</span> (<span style="color: #00ffff;">:websocket?</span> request)
        (let* [temp__4090__auto__ (clojure.core/<span style="color: #00ff00;">get-in</span> request [<span style="color: #00ffff;">:headers</span> <span style="color: #00ffff;">"sec-websocket-key"</span>])]
              (<span style="color: #00ff00;">if</span> temp__4090__auto__
                (let* [key__2755__auto__ temp__4090__auto__]
                      (<span style="color: #00ff00;">do</span> (<span style="color: #00ff00;">.</span> channel <span style="color: #ff0000;">sendHandshake</span> {<span style="color: #00ffff;">"Sec-WebSocket-Accept"</span> (org.httpkit.server/accept key__2755__auto__)
                                                    <span style="color: #00ffff;">"Upgrade"</span> <span style="color: #00ffff;">"websocket"</span>
                                                    <span style="color: #00ffff;">"Connection"</span> <span style="color: #00ffff;">"Upgrade"</span>})
                          (on-receive channel
                                      (fn* ([data] (send! channel data))))
                          {<span style="color: #00ffff;">:body</span> channel})) {<span style="color: #00ffff;">:status</span> 400
                                             <span style="color: #00ffff;">:body</span> <span style="color: #00ffff;">"Bad Sec-WebSocket-Key header"</span>}))
        (<span style="color: #00ff00;">do</span> (on-receive channel
                        (fn* ([data] (send! channel data))))
            {<span style="color: #00ffff;">:body</span> channel})))
</pre>
</div>
</section>

</section>
<section>
<section id="sec-25" >

<h2>Websockets</h2>
<p>
Websockets are long-lived connections between the client and the server through which messages can be sent in both directions.
</p>
</section>
</section>
<section>
<section id="sec-26" >

<h2>In your browser's js console&#x2026;</h2>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ff00;">var</span> <span style="color: #0000ff;">socket</span> = <span style="color: #00ff00;">new</span> <span style="color: #ffff00;">WebSocket</span>(<span style="color: #00ffff;">"ws://localhost:3000/echo"</span>);

socket.onmessage = <span style="color: #00ff00;">function</span>(<span style="color: #0000ff;">event</span>) { console.log(event.data); }

socket.send(<span style="color: #00ffff;">"Data to be sent"</span>);
</pre>
</div>

<p>
You should see the data you sent echoed back.
</p>
</section>
</section>
<section>
<section id="sec-27" >

<h2>Exercise</h2>
<p>
Make the server multi-client.
</p>

<p>
Keep a list of connected clients and send each message to all clients.
</p>

<p>
Test it out with two browser windows.
</p>
</section>
</section>
<section>
<section id="sec-28" >

<h2>One I prepared earlier</h2>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">def</span> <span style="color: #0000ff;">clients</span> (<span style="color: #00ff00;">atom</span> []))

(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">make-socket!</span> [request]
  (with-channel request client
    (<span style="color: #00ff00;">swap!</span> clients conj client)
    (on-receive client
                (<span style="color: #00ff00;">fn</span> [data]
                  (<span style="color: #00ff00;">doseq</span> [a-client @clients]
                    (send! a-client data))))))
</pre>
</div>
</section>
</section>
<section>
<section id="sec-29" >

<h2>ClojureScript</h2>
<p>
You can write client-side javascript in Clojure too!
</p>
</section>

</section>
<section>
<section id="sec-30" >

<h2>Include Clojurescript in your project</h2>
<p>
In dependencies&#x2026; 
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ffff;">:dependencies</span> [[org.clojure/clojurescript <span style="color: #00ffff;">"0.0-XXXX"</span>] ...]
</pre>
</div>

<p>
Clojurescript is compiled, so add the compiler to your plugins&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ffff;">:plugins</span> [[lein-cljsbuild <span style="color: #00ffff;">"1.0.1-SNAPSHOT"</span>] ...]
</pre>
</div>

<p>
&#x2026; And tell cljsbuild where to put your compiled javascript:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #00ffff;">:cljsbuild</span> {<span style="color: #00ffff;">:builds</span> {<span style="color: #00ffff;">:main</span> {<span style="color: #00ffff;">:compiler</span> {<span style="color: #00ffff;">:output-to</span> <span style="color: #00ffff;">"resources/public/js/main.js"</span>}}}}
</pre>
</div>
</section>
</section>
<section>
<section id="sec-31" >

<h2>Keeping the Clojure(Script) separate</h2>
<p>
Next to your /src directory, create a /src-cljs/chitter directory
</p>

<p>
This is where cljsbuild will look for clojurescript files by default
</p>
</section>
</section>
<section>
<section id="sec-32" >

<h2>Writing your first ClojureScript</h2>
<p>
Create the file
</p>

<p>
/src-cljs/chitter/client.cljs
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ff00;">ns</span> chitter.client)

(<span style="color: #00ff00;">defn</span> <span style="color: #0000ff;">greet</span> [name]
  (<span style="color: #00ff00;">str</span> <span style="color: #00ffff;">"Hello "</span> name))
</pre>
</div>

<p>
And visit&#x2026;
</p>

<p>
<a href="http://localhost:3000/js/main.js">http://localhost:3000/js/main.js</a>
</p>
</section>
</section>
<section>
<section id="sec-33" >

<h2>Include this in our page</h2>
<div class="org-src-container">

<pre class="src src-clojure">[hiccup.page <span style="color: #00ffff;">:refer</span> [html5 include-js]]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(html5
   [<span style="color: #00ffff;">:head</span>
    (include-js <span style="color: #00ffff;">"js/main.js"</span>)]
   [<span style="color: #00ffff;">:body</span> ....
   ])
</pre>
</div>
</section>
</section>
